In [189]:
import pandas as pd

In [190]:
menu = pd.Series(['비빔밥', '김치찌개', '된장찌개'])
menu

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

In [191]:
price = pd.Series([10000, 9000, 8000])
price

0    10000
1     9000
2     8000
dtype: int64

In [192]:
df = pd.DataFrame({'메뉴':menu, '가격':price})
df

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [193]:
df.메뉴

0     비빔밥
1    김치찌개
2    된장찌개
Name: 메뉴, dtype: object

In [194]:
df[['메뉴']]

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [195]:
df.메뉴.to_frame()

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [196]:
df[['가격','메뉴']]

      가격    메뉴
0  10000   비빔밥
1   9000  김치찌개
2   8000  된장찌개

In [197]:
cols = ['가격', '메뉴']
df[cols]

      가격    메뉴
0  10000   비빔밥
1   9000  김치찌개
2   8000  된장찌개

In [198]:
type(df['가격']), type(df[['메뉴']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [199]:
df = pd.DataFrame({
    "메뉴":['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격":[4500, 5000, 5500, 5000, 4000, 5900, 5300],
    "칼로리":[10, 110, 250, 110, 20, 210, 0],
})
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [200]:
df.to_csv('test.csv')

In [201]:
temp_df = pd.read_csv('test.csv', index_col=None, usecols=['메뉴', '가격'], encoding='utf-8')
temp_df

      메뉴    가격
0  아메리카노  4500
1   카페라떼  5000
2   카페모카  5500
3   카푸치노  5000
4  에스프레소  4000
5    밀크티  5900
6     녹차  5300

In [202]:
df.sample(3)

     메뉴    가격  칼로리
3  카푸치노  5000  110
6    녹차  5300    0
1  카페라떼  5000  110

In [203]:
df.sample()

    메뉴    가격  칼로리
5  밀크티  5900  210

In [204]:
df.shape

(7, 3)

In [205]:
# 컬럼별 데이터 타입
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [206]:
# 컬럼별 상관관계
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [207]:
# 중복 값이 있는 데이터 생성
df_car = pd.DataFrame({
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S', 'M','S']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [208]:
# 고유한 값
print(df_car.nunique())
df_car['size'].nunique(), df_car['car'].nunique()

car     2
size    3
dtype: int64

(3, 2)

In [209]:
df_car['car'].unique(), df_car['size'].unique()

(array(['Sedan', 'SUV'], dtype=object), array(['S', 'M', 'L'], dtype=object))

In [210]:
df_car['car'].value_counts()

car
Sedan    7
SUV      4
Name: count, dtype: int64

In [211]:
display(df.head())
df.describe()

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [212]:
display(df_car.head())
df_car.describe(include='O')

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S
3    SUV    S
4    SUV    M

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

In [213]:
# 데이터 준비
data = {
    "메뉴":['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격":[4500.0, 5000.0, 5500.0, 5000.0, 4000.0, 5900.0, 5300.0],
    "칼로리":['10', '110', '250', '110', '20', '210', '0'],
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      object
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [214]:
df['가격'] = df['가격'].astype("int64")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [215]:
df['칼로리'] = df['칼로리'].astype("int64")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [216]:
df.to_csv('cafe.csv')

In [217]:
df = pd.read_csv('cafe.csv', index_col=0)
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [218]:
df['new'] = 0
df

      메뉴    가격  칼로리  new
0  아메리카노  4500   10    0
1   카페라떼  5000  110    0
2   카페모카  5500  250    0
3   카푸치노  5000  110    0
4  에스프레소  4000   20    0
5    밀크티  5900  210    0
6     녹차  5300    0    0

In [219]:
discount = 0.2
df['할인가'] = df['가격']*(1-discount)
df

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
1   카페라떼  5000  110    0  4000.0
2   카페모카  5500  250    0  4400.0
3   카푸치노  5000  110    0  4000.0
4  에스프레소  4000   20    0  3200.0
5    밀크티  5900  210    0  4720.0
6     녹차  5300    0    0  4240.0

In [220]:
# 행 = 0
# 열 = 1

df.drop(1, axis=0)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
2   카페모카  5500  250    0  4400.0
3   카푸치노  5000  110    0  4000.0
4  에스프레소  4000   20    0  3200.0
5    밀크티  5900  210    0  4720.0
6     녹차  5300    0    0  4240.0

In [221]:
df.drop('메뉴', axis=1)

     가격  칼로리  new     할인가
0  4500   10    0  3600.0
1  5000  110    0  4000.0
2  5500  250    0  4400.0
3  5000  110    0  4000.0
4  4000   20    0  3200.0
5  5900  210    0  4720.0
6  5300    0    0  4240.0

In [222]:
df = pd.read_csv('cafe.csv', index_col=0)
df.head(3)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250

In [223]:
df.loc[0]

메뉴     아메리카노
가격      4500
칼로리       10
Name: 0, dtype: object

In [224]:
df.loc[1, '가격']

5000

In [225]:
df.loc[:, '칼로리']

0     10
1    110
2    250
3    110
4     20
5    210
6      0
Name: 칼로리, dtype: int64

In [226]:
df.loc[1, '가격':'칼로리']

가격     5000
칼로리     110
Name: 1, dtype: object

In [227]:
df.loc[1, ['메뉴','칼로리']]

메뉴     카페라떼
칼로리     110
Name: 1, dtype: object

In [228]:
df.loc[1:3, ['메뉴','칼로리']]

     메뉴  칼로리
1  카페라떼  110
2  카페모카  250
3  카푸치노  110

In [229]:
df.drop(0, axis=0, inplace=True)
df.iloc[0]
# df.loc[0]

메뉴     카페라떼
가격     5000
칼로리     110
Name: 1, dtype: object

In [230]:
df

      메뉴    가격  칼로리
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [231]:
df.iloc[:,1]

1    5000
2    5500
3    5000
4    4000
5    5900
6    5300
Name: 가격, dtype: int64

In [232]:
df = pd.read_csv('cafe.csv', index_col=0)
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [233]:
import numpy as np

df['원산지'] = np.nan
df

      메뉴    가격  칼로리  원산지
0  아메리카노  4500   10  NaN
1   카페라떼  5000  110  NaN
2   카페모카  5500  250  NaN
3   카푸치노  5000  110  NaN
4  에스프레소  4000   20  NaN
5    밀크티  5900  210  NaN
6     녹차  5300    0  NaN

In [234]:
df.loc[0, '원산지'] = '콜롬비아'
df.iloc[2:4, 3] = '과테말라'
df

C:\Users\lemon\AppData\Local\Temp\ipykernel_15280\3359314603.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '콜롬비아' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[0, '원산지'] = '콜롬비아'

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20   NaN
5    밀크티  5900  210   NaN
6     녹차  5300    0   NaN

In [235]:
df.loc['시즌'] = ['크리스마스라떼', 6000, 300, '한국']
df.tail(3)

         메뉴    가격  칼로리  원산지
5       밀크티  5900  210  NaN
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국

In [236]:
df.loc[7] = {'메뉴': '새로운 커피', '가격':2000, '칼로리':20}
df.tail(3)

         메뉴    가격  칼로리  원산지
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국
7    새로운 커피  2000   20  NaN

In [237]:
df.drop('시즌', axis=0, inplace=True)
df.to_csv('cafe2.csv', index=False)

In [238]:
df = pd.read_csv('cafe2.csv')
df

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [239]:
df.sort_index(ascending=False)

       메뉴    가격  칼로리   원산지
7  새로운 커피  2000   20   NaN
6      녹차  5300    0   NaN
5     밀크티  5900  210   NaN
4   에스프레소  4000   20   NaN
3    카푸치노  5000  110  과테말라
2    카페모카  5500  250  과테말라
1    카페라떼  5000  110   NaN
0   아메리카노  4500   10  콜롬비아

In [240]:
df.sort_values(by='가격', ascending=False)

       메뉴    가격  칼로리   원산지
5     밀크티  5900  210   NaN
2    카페모카  5500  250  과테말라
6      녹차  5300    0   NaN
1    카페라떼  5000  110   NaN
3    카푸치노  5000  110  과테말라
0   아메리카노  4500   10  콜롬비아
4   에스프레소  4000   20   NaN
7  새로운 커피  2000   20   NaN

In [241]:
df.sort_values(by=['가격', '메뉴'], ascending=[False, True], inplace=True)
df

       메뉴    가격  칼로리   원산지
5     밀크티  5900  210   NaN
2    카페모카  5500  250  과테말라
6      녹차  5300    0   NaN
1    카페라떼  5000  110   NaN
3    카푸치노  5000  110  과테말라
0   아메리카노  4500   10  콜롬비아
4   에스프레소  4000   20   NaN
7  새로운 커피  2000   20   NaN

In [242]:
df.reset_index(drop=True, inplace=True)
df

       메뉴    가격  칼로리   원산지
0     밀크티  5900  210   NaN
1    카페모카  5500  250  과테말라
2      녹차  5300    0   NaN
3    카페라떼  5000  110   NaN
4    카푸치노  5000  110  과테말라
5   아메리카노  4500   10  콜롬비아
6   에스프레소  4000   20   NaN
7  새로운 커피  2000   20   NaN

In [243]:
df = pd.read_csv('cafe2.csv')
df

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [244]:
df[df.칼로리 < 50]

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
4   에스프레소  4000   20   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [245]:
df[~df.칼로리 < 50]
df[~(df.메뉴 == '아메리카노')]

       메뉴    가격  칼로리   원산지
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [246]:
df[(df['가격']>=5000)&(df['칼로리']>100)]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN

In [247]:
cond1 = df['가격'] >= 5000
cond2 = df['칼로리'] > 100
df[cond1 | cond2]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN
6    녹차  5300    0   NaN

In [248]:
df[df['원산지'] == '과테말라']

     메뉴    가격  칼로리   원산지
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라

In [249]:
df[(df['원산지']=='과테말라')&(df['가격']<=5000)]

     메뉴    가격  칼로리   원산지
3  카푸치노  5000  110  과테말라

In [250]:
df[df['메뉴'].isin(['녹차'])]

   메뉴    가격  칼로리  원산지
6  녹차  5300    0  NaN

In [251]:
df['가격'].isin([5000, 5500])

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7    False
Name: 가격, dtype: bool

In [252]:
df[df['메뉴'].isin(['녹차', '카페라떼', '카푸치노'])]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
3  카푸치노  5000  110  과테말라
6    녹차  5300    0   NaN

In [253]:
df = pd.read_csv('cafe2.csv')
df

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  새로운 커피  2000   20   NaN

In [254]:
df.isnull()

      메뉴     가격    칼로리    원산지
0  False  False  False  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False  False
4  False  False  False   True
5  False  False  False   True
6  False  False  False   True
7  False  False  False   True

In [255]:
df.isnull().sum()

메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64

In [256]:
df.isna()

      메뉴     가격    칼로리    원산지
0  False  False  False  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False  False
4  False  False  False   True
5  False  False  False   True
6  False  False  False   True
7  False  False  False   True

In [257]:
df.isna().sum()

메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64

In [258]:
df['원산지'].fillna('코스타리카', inplace=True)
df

C:\Users\lemon\AppData\Local\Temp\ipykernel_15280\1314037755.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['원산지'].fillna('코스타리카', inplace=True)

       메뉴    가격  칼로리    원산지
0   아메리카노  4500   10   콜롬비아
1    카페라떼  5000  110  코스타리카
2    카페모카  5500  250   과테말라
3    카푸치노  5000  110   과테말라
4   에스프레소  4000   20  코스타리카
5     밀크티  5900  210  코스타리카
6      녹차  5300    0  코스타리카
7  새로운 커피  2000   20  코스타리카

In [259]:
df.to_csv('cafe3.csv', index=False)

In [260]:
df = pd.read_csv('cafe3.csv')
df

       메뉴    가격  칼로리    원산지
0   아메리카노  4500   10   콜롬비아
1    카페라떼  5000  110  코스타리카
2    카페모카  5500  250   과테말라
3    카푸치노  5000  110   과테말라
4   에스프레소  4000   20  코스타리카
5     밀크티  5900  210  코스타리카
6      녹차  5300    0  코스타리카
7  새로운 커피  2000   20  코스타리카

In [261]:
df.replace('녹차', '그린티', inplace=True)
df.replace('아메리카노', '룽고', inplace=True)
df

       메뉴    가격  칼로리    원산지
0      룽고  4500   10   콜롬비아
1    카페라떼  5000  110  코스타리카
2    카페모카  5500  250   과테말라
3    카푸치노  5000  110   과테말라
4   에스프레소  4000   20  코스타리카
5     밀크티  5900  210  코스타리카
6     그린티  5300    0  코스타리카
7  새로운 커피  2000   20  코스타리카

In [262]:
change_dict = {'룽고':'아메리카노', '그린티':'녹차'}
df.replace(change_dict, inplace=True)
df

       메뉴    가격  칼로리    원산지
0   아메리카노  4500   10   콜롬비아
1    카페라떼  5000  110  코스타리카
2    카페모카  5500  250   과테말라
3    카푸치노  5000  110   과테말라
4   에스프레소  4000   20  코스타리카
5     밀크티  5900  210  코스타리카
6      녹차  5300    0  코스타리카
7  새로운 커피  2000   20  코스타리카

In [263]:
df.loc[df[df['메뉴']=='녹차'].index.item(), '원산지'] = '대한민국'
df

       메뉴    가격  칼로리    원산지
0   아메리카노  4500   10   콜롬비아
1    카페라떼  5000  110  코스타리카
2    카페모카  5500  250   과테말라
3    카푸치노  5000  110   과테말라
4   에스프레소  4000   20  코스타리카
5     밀크티  5900  210  코스타리카
6      녹차  5300    0   대한민국
7  새로운 커피  2000   20  코스타리카

In [264]:
df.loc[1:2, '이벤트가'] = 1000
df

       메뉴    가격  칼로리    원산지    이벤트가
0   아메리카노  4500   10   콜롬비아     NaN
1    카페라떼  5000  110  코스타리카  1000.0
2    카페모카  5500  250   과테말라  1000.0
3    카푸치노  5000  110   과테말라     NaN
4   에스프레소  4000   20  코스타리카     NaN
5     밀크티  5900  210  코스타리카     NaN
6      녹차  5300    0   대한민국     NaN
7  새로운 커피  2000   20  코스타리카     NaN

In [265]:
df.to_csv('cafe4.csv', index=False)

In [266]:
df = pd.DataFrame({'A': ['데이터 분석', '기본 학습서', '퇴근 후 열공'],
                   'B': [10, 20, 30],
                   'C': ['ab cd', 'AB CD', 'ab cd ']
                   })
df

         A   B       C
0   데이터 분석  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [267]:
df['A'].replace('분석', '시각화')

0     데이터 분석
1     기본 학습서
2    퇴근 후 열공
Name: A, dtype: object

In [268]:
df['A'] = df['A'].str.replace('분석', '시각화')
df

         A   B       C
0  데이터 시각화  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [269]:
df['A'].str.split().str[0]

0    데이터
1     기본
2     퇴근
Name: A, dtype: object

In [270]:
df['D'] = df['A'].str.split().str[0]
df

         A   B       C    D
0  데이터 시각화  10   ab cd  데이터
1   기본 학습서  20   AB CD   기본
2  퇴근 후 열공  30  ab cd    퇴근

In [271]:
df['A'].str.contains('기본')

0    False
1     True
2    False
Name: A, dtype: bool

In [272]:
df['기본포함유무'] = df['A'].str.contains('기본')
df

         A   B       C    D  기본포함유무
0  데이터 시각화  10   ab cd  데이터   False
1   기본 학습서  20   AB CD   기본    True
2  퇴근 후 열공  30  ab cd    퇴근   False

In [273]:
df['문자길이'] = df['A'].str.len()
df

         A   B       C    D  기본포함유무  문자길이
0  데이터 시각화  10   ab cd  데이터   False     7
1   기본 학습서  20   AB CD   기본    True     6
2  퇴근 후 열공  30  ab cd    퇴근   False     7

In [274]:
df['C'] = df['C'].str.lower()
df

         A   B       C    D  기본포함유무  문자길이
0  데이터 시각화  10   ab cd  데이터   False     7
1   기본 학습서  20   ab cd   기본    True     6
2  퇴근 후 열공  30  ab cd    퇴근   False     7

In [275]:
df['C'] = df['C'].str.replace(' ','')
df

         A   B     C    D  기본포함유무  문자길이
0  데이터 시각화  10  abcd  데이터   False     7
1   기본 학습서  20  abcd   기본    True     6
2  퇴근 후 열공  30  abcd   퇴근   False     7

In [276]:
df['C'].str[0:3]

0    abc
1    abc
2    abc
Name: C, dtype: object

In [277]:
df = pd.read_csv('cafe4.csv')
df

       메뉴    가격  칼로리    원산지    이벤트가
0   아메리카노  4500   10   콜롬비아     NaN
1    카페라떼  5000  110  코스타리카  1000.0
2    카페모카  5500  250   과테말라  1000.0
3    카푸치노  5000  110   과테말라     NaN
4   에스프레소  4000   20  코스타리카     NaN
5     밀크티  5900  210  코스타리카     NaN
6      녹차  5300    0   대한민국     NaN
7  새로운 커피  2000   20  코스타리카     NaN

In [278]:
len(df)

8

In [279]:
df.shape

(8, 5)

In [280]:
sum(df['칼로리'])
# 총 값

730

In [281]:
sum(df['칼로리'] > 50)
# 조건에 맞는 개수

4

In [282]:
df.sum(axis=1, numeric_only=True)

0    4510.0
1    6110.0
2    6750.0
3    5110.0
4    4020.0
5    6110.0
6    5300.0
7    2020.0
dtype: float64

In [283]:
df['가격'].max()
df['가격'].min()
df['가격'].mean()
df['가격'].median()
df['가격'].sum()
df['가격'].std()
df['가격'].var()

1488571.4285714286

In [284]:
print('1사분위수: ', df['가격'].quantile(.25))
print('2사분위수: ', df['가격'].quantile(.50))
print('3사분위수: ', df['가격'].quantile(.75))

1사분위수:  4375.0
2사분위수:  5000.0
3사분위수:  5350.0

In [285]:
# 가격의 1사분위수보다 작은 값만 보기
df[df['가격'].quantile(0.25) > df['가격']]

       메뉴    가격  칼로리    원산지  이벤트가
4   에스프레소  4000   20  코스타리카   NaN
7  새로운 커피  2000   20  코스타리카   NaN

In [286]:
# 3사분위수보다 큰 데이터만 보기
df[df['가격'] > df['가격'].quantile(0.75)]

     메뉴    가격  칼로리    원산지    이벤트가
2  카페모카  5500  250   과테말라  1000.0
5   밀크티  5900  210  코스타리카     NaN

In [287]:
# 최빈값
df['원산지'].mode()[0]

'코스타리카'

In [288]:
# 최소값 혹은 최대값의 인덱스 찾기
print(df['가격'].idxmax())
df.loc[5]

5

메뉴        밀크티
가격       5900
칼로리       210
원산지     코스타리카
이벤트가      NaN
Name: 5, dtype: object

In [289]:
# 최소로
df.loc[df['가격'].idxmin()]

메뉴      새로운 커피
가격        2000
칼로리         20
원산지      코스타리카
이벤트가       NaN
Name: 7, dtype: object

In [290]:
# 특정 컬럼에서 큰 순서 상위 n개 반환
df.nlargest(3, '가격')

     메뉴    가격  칼로리    원산지    이벤트가
5   밀크티  5900  210  코스타리카     NaN
2  카페모카  5500  250   과테말라  1000.0
6    녹차  5300    0   대한민국     NaN

In [291]:
df.nsmallest(5, '가격')

       메뉴    가격  칼로리    원산지    이벤트가
7  새로운 커피  2000   20  코스타리카     NaN
4   에스프레소  4000   20  코스타리카     NaN
0   아메리카노  4500   10   콜롬비아     NaN
1    카페라떼  5000  110  코스타리카  1000.0
3    카푸치노  5000  110   과테말라     NaN

In [292]:
# apply 사용하기

def cal(x):
    if x >= 100: return 'No'
    else: return 'Yes'

# 확인
display(df['칼로리'].apply(cal))

# 열로 추가
df['먹어도 될까'] = df['칼로리'].apply(cal)
df

0    Yes
1     No
2     No
3     No
4    Yes
5     No
6    Yes
7    Yes
Name: 칼로리, dtype: object

       메뉴    가격  칼로리    원산지    이벤트가 먹어도 될까
0   아메리카노  4500   10   콜롬비아     NaN    Yes
1    카페라떼  5000  110  코스타리카  1000.0     No
2    카페모카  5500  250   과테말라  1000.0     No
3    카푸치노  5000  110   과테말라     NaN     No
4   에스프레소  4000   20  코스타리카     NaN    Yes
5     밀크티  5900  210  코스타리카     NaN     No
6      녹차  5300    0   대한민국     NaN    Yes
7  새로운 커피  2000   20  코스타리카     NaN    Yes

In [293]:
# melt 사용해보기
import pandas as pd
df = pd.DataFrame({'Name': {0: '쿼카', 1: '알파카', 2: '시바견'},
                   '수학': {0: 90, 1: 93, 2: 85},
                   '영어': {0: 92, 1: 84, 2: 86},
                   '국어': {0: 91, 1: 94, 2: 83},})

df

  Name  수학  영어  국어
0   쿼카  90  92  91
1  알파카  93  84  94
2  시바견  85  86  83

In [294]:
pd.melt(df, id_vars=['Name'], value_vars=['수학', '영어', '국어'])

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     84
5  시바견       영어     86
6   쿼카       국어     91
7  알파카       국어     94
8  시바견       국어     83

In [295]:
# 그룹핑

In [296]:
df = pd.read_csv('cafe4.csv')
df.head(3)

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0

In [297]:
df.groupby(['원산지']).mean(numeric_only=True)

           가격    칼로리    이벤트가
원산지
과테말라   5250.0  180.0  1000.0
대한민국   5300.0    0.0     NaN
코스타리카  4225.0   90.0  1000.0
콜롬비아   4500.0   10.0     NaN

In [298]:
df.groupby(['원산지', '칼로리']).mean(numeric_only=True)

               가격    이벤트가
원산지   칼로리
과테말라  110  5000.0     NaN
      250  5500.0  1000.0
대한민국  0    5300.0     NaN
코스타리카 20   3000.0     NaN
      110  5000.0  1000.0
      210  5900.0     NaN
콜롬비아  10   4500.0     NaN

In [299]:
# mean, sum, max, min, count, size
df.groupby('원산지').min()
df.groupby('원산지').max()
df.groupby('원산지').sum()
df.groupby('원산지').size()
df.groupby('원산지').count()

       메뉴  가격  칼로리  이벤트가
원산지
과테말라    2   2    2     1
대한민국    1   1    1     0
코스타리카   4   4    4     1
콜롬비아    1   1    1     0

In [300]:
df.groupby(['원산지', '칼로리']).mean(numeric_only=True)

               가격    이벤트가
원산지   칼로리
과테말라  110  5000.0     NaN
      250  5500.0  1000.0
대한민국  0    5300.0     NaN
코스타리카 20   3000.0     NaN
      110  5000.0  1000.0
      210  5900.0     NaN
콜롬비아  10   4500.0     NaN

In [301]:
df.groupby(['원산지', '칼로리']).agg(['max', 'min'])

              메뉴            가격          이벤트가
             max     min   max   min     max     min
원산지   칼로리
과테말라  110   카푸치노    카푸치노  5000  5000     NaN     NaN
      250   카페모카    카페모카  5500  5500  1000.0  1000.0
대한민국  0       녹차      녹차  5300  5300     NaN     NaN
코스타리카 20   에스프레소  새로운 커피  4000  2000     NaN     NaN
      110   카페라떼    카페라떼  5000  5000  1000.0  1000.0
      210    밀크티     밀크티  5900  5900     NaN     NaN
콜롬비아  10   아메리카노   아메리카노  4500  4500     NaN     NaN

In [302]:
# reset_index

df.groupby(['원산지', '칼로리']).mean(numeric_only=True).reset_index()

     원산지  칼로리      가격    이벤트가
0   과테말라  110  5000.0     NaN
1   과테말라  250  5500.0  1000.0
2   대한민국    0  5300.0     NaN
3  코스타리카   20  3000.0     NaN
4  코스타리카  110  5000.0  1000.0
5  코스타리카  210  5900.0     NaN
6   콜롬비아   10  4500.0     NaN

In [303]:
# 시계열 데이터

import pandas as pd
data = {
    'Date1': ['2024-02-17', '2024-02-18', '2024-02-19', '2024-02-20'],
    'Date2': ['2024:02:17', '2024:02:18', '2024:02:19', '2024:02:20'],
    'Date3': ['24/02/17', '24/02/18', '24/02/19', '24/02/20'],
    'Date4': ['02/17/2024', '02/18/2024', '02/19/2024', '02/20/2024'],
    'Date5': ['17-Feb-2024', '18-Feb-2024', '19-Feb-2024', '20-Feb-2024'],
    'DateTime1': ['24-02-17 13:45:30', '24-02-18 14:55:45', '24-02-19 15:30:15', '24-02-20 16:10:50'],
    'DateTime2': ['2024-02-17 13-45-30', '2024-02-18 14-55-45', '2024-02-19 15-30-15', '2024-02-20 16-10-50'],
    'DateTime3': ['02/17/2024 01:45:30 PM', '02/18/2024 02:55:45 PM', '02/19/2024 03:30:15 AM', '02/20/2024 04:10:50 AM'],
    'DateTime4': ['17 Feb 2024 13:45:30', '18 Feb 2024 14:55:45', '19 Feb 2024 15:30:15', '20 Feb 2024 16:10:50']
}

df = pd.DataFrame(data)
df.to_csv("date_data.csv", index=False)
df

,Date1,Date2,Date3,Date4,Date5,DateTime1,DateTime2,DateTime3,DateTime4
0,2024-02-17,2024:02:17,24/02/17,02/17/2024,17-Feb-2024,24-02-17 13:45:30,2024-02-17 13-45-30,02/17/2024 01:45:30 PM,17 Feb 2024 13:45:30
1,2024-02-18,2024:02:18,24/02/18,02/18/2024,18-Feb-2024,24-02-18 14:55:45,2024-02-18 14-55-45,02/18/2024 02:55:45 PM,18 Feb 2024 14:55:45
2,2024-02-19,2024:02:19,24/02/19,02/19/2024,19-Feb-2024,24-02-19 15:30:15,2024-02-19 15-30-15,02/19/2024 03:30:15 AM,19 Feb 2024 15:30:15
3,2024-02-20,2024:02:20,24/02/20,02/20/2024,20-Feb-2024,24-02-20 16:10:50,2024-02-20 16-10-50,02/20/2024 04:10:50 AM,20 Feb 2024 16:10:50

In [304]:
# 날짜와 시간을 자동으로 인식하지 못해서 str, object로 인식함
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date1      4 non-null      object
 1   Date2      4 non-null      object
 2   Date3      4 non-null      object
 3   Date4      4 non-null      object
 4   Date5      4 non-null      object
 5   DateTime1  4 non-null      object
 6   DateTime2  4 non-null      object
 7   DateTime3  4 non-null      object
 8   DateTime4  4 non-null      object
dtypes: object(9)
memory usage: 416.0+ bytes

In [305]:
# datatime으로 파싱하기
target = 'DateTime4'
perso_format = None

display(df[target])
pd.to_datetime(df[target], format=perso_format)

0    17 Feb 2024 13:45:30
1    18 Feb 2024 14:55:45
2    19 Feb 2024 15:30:15
3    20 Feb 2024 16:10:50
Name: DateTime4, dtype: object

0   2024-02-17 13:45:30
1   2024-02-18 14:55:45
2   2024-02-19 15:30:15
3   2024-02-20 16:10:50
Name: DateTime4, dtype: datetime64[ns]

In [306]:
# %Y 4자리 #y 2자리
target, perso_format = 'Date2', '%Y:%m:%d'
print((target+(' - '))*10)
display(df[target])
display(pd.to_datetime(df[target], format=perso_format))

target, perso_format = 'Date3', '%y/%m/%d'
print((target+(' - '))*10)
display(df[target])
display(pd.to_datetime(df[target], format=perso_format))

Date2 - Date2 - Date2 - Date2 - Date2 - Date2 - Date2 - Date2 - Date2 - Date2 -

0    2024:02:17
1    2024:02:18
2    2024:02:19
3    2024:02:20
Name: Date2, dtype: object

0   2024-02-17
1   2024-02-18
2   2024-02-19
3   2024-02-20
Name: Date2, dtype: datetime64[ns]

Date3 - Date3 - Date3 - Date3 - Date3 - Date3 - Date3 - Date3 - Date3 - Date3 -

0    24/02/17
1    24/02/18
2    24/02/19
3    24/02/20
Name: Date3, dtype: object

0   2024-02-17
1   2024-02-18
2   2024-02-19
3   2024-02-20
Name: Date3, dtype: datetime64[ns]

In [307]:
target, perso_format = 'DateTime1', '%y-%m-%d %H:%M:%S'
print((target+(' - '))*10)
display(df[target])
display(pd.to_datetime(df[target], format=perso_format))

target, perso_format = 'DateTime2', '%Y-%m-%d %H-%M-%S'
print((target+(' - '))*10)
display(df[target])
display(pd.to_datetime(df[target], format=perso_format))

DateTime1 - DateTime1 - DateTime1 - DateTime1 - DateTime1 - DateTime1 - DateTime1 - DateTime1 - DateTime1 - DateTime1 -

0    24-02-17 13:45:30
1    24-02-18 14:55:45
2    24-02-19 15:30:15
3    24-02-20 16:10:50
Name: DateTime1, dtype: object

0   2024-02-17 13:45:30
1   2024-02-18 14:55:45
2   2024-02-19 15:30:15
3   2024-02-20 16:10:50
Name: DateTime1, dtype: datetime64[ns]

DateTime2 - DateTime2 - DateTime2 - DateTime2 - DateTime2 - DateTime2 - DateTime2 - DateTime2 - DateTime2 - DateTime2 -

0    2024-02-17 13-45-30
1    2024-02-18 14-55-45
2    2024-02-19 15-30-15
3    2024-02-20 16-10-50
Name: DateTime2, dtype: object

0   2024-02-17 13:45:30
1   2024-02-18 14:55:45
2   2024-02-19 15:30:15
3   2024-02-20 16:10:50
Name: DateTime2, dtype: datetime64[ns]

In [308]:
# format 설정해서 한 번에 불러오기
df = pd.read_csv('date_data.csv')
df['Date2'] = pd.to_datetime(df['Date2'], format='%Y:%m:%d')
df['Date3'] = pd.to_datetime(df['Date3'], format='%y/%m/%d')
df['DateTime1'] = pd.to_datetime(df['DateTime1'], format='%y-%m-%d %H:%M:%S')
df['DateTime2'] = pd.to_datetime(df['DateTime2'], format='%Y-%m-%d %H-%M-%S')
df

,Date1,Date2,Date3,Date4,Date5,DateTime1,DateTime2,DateTime3,DateTime4
0,2024-02-17,2024-02-17,2024-02-17,02/17/2024,17-Feb-2024,2024-02-17 13:45:30,2024-02-17 13:45:30,02/17/2024 01:45:30 PM,17 Feb 2024 13:45:30
1,2024-02-18,2024-02-18,2024-02-18,02/18/2024,18-Feb-2024,2024-02-18 14:55:45,2024-02-18 14:55:45,02/18/2024 02:55:45 PM,18 Feb 2024 14:55:45
2,2024-02-19,2024-02-19,2024-02-19,02/19/2024,19-Feb-2024,2024-02-19 15:30:15,2024-02-19 15:30:15,02/19/2024 03:30:15 AM,19 Feb 2024 15:30:15
3,2024-02-20,2024-02-20,2024-02-20,02/20/2024,20-Feb-2024,2024-02-20 16:10:50,2024-02-20 16:10:50,02/20/2024 04:10:50 AM,20 Feb 2024 16:10:50

In [309]:
# 변환한 것만 보기
cols = ['Date2', 'Date3', 'DateTime1', 'DateTime2']
df[cols]

       Date2      Date3           DateTime1           DateTime2
0 2024-02-17 2024-02-17 2024-02-17 13:45:30 2024-02-17 13:45:30
1 2024-02-18 2024-02-18 2024-02-18 14:55:45 2024-02-18 14:55:45
2 2024-02-19 2024-02-19 2024-02-19 15:30:15 2024-02-19 15:30:15
3 2024-02-20 2024-02-20 2024-02-20 16:10:50 2024-02-20 16:10:50

In [188]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date2      4 non-null      datetime64[ns]
 1   Date3      4 non-null      datetime64[ns]
 2   DateTime1  4 non-null      datetime64[ns]
 3   DateTime2  4 non-null      datetime64[ns]
dtypes: datetime64[ns](4)
memory usage: 256.0 bytes

In [313]:
# dt 를 이용해서 날짜 정보 뽑아내기
# year, month, day, hour, minute, second
df['Year'] = df['DateTime1'].dt.year
df['month'] = df['DateTime1'].dt.month
df['day'] = df['DateTime1'].dt.day
df['hour'] = df['DateTime1'].dt.hour
df['minute'] = df['DateTime1'].dt.minute
df['second'] = df['DateTime1'].dt.second
df

,Date1,Date2,Date3,Date4,Date5,DateTime1,DateTime2,DateTime3,DateTime4,Year,month,day,hour,minute,second
0,2024-02-17,2024-02-17,2024-02-17,02/17/2024,17-Feb-2024,2024-02-17 13:45:30,2024-02-17 13:45:30,02/17/2024 01:45:30 PM,17 Feb 2024 13:45:30,2024,2,17,13,45,30
1,2024-02-18,2024-02-18,2024-02-18,02/18/2024,18-Feb-2024,2024-02-18 14:55:45,2024-02-18 14:55:45,02/18/2024 02:55:45 PM,18 Feb 2024 14:55:45,2024,2,18,14,55,45
2,2024-02-19,2024-02-19,2024-02-19,02/19/2024,19-Feb-2024,2024-02-19 15:30:15,2024-02-19 15:30:15,02/19/2024 03:30:15 AM,19 Feb 2024 15:30:15,2024,2,19,15,30,15
3,2024-02-20,2024-02-20,2024-02-20,02/20/2024,20-Feb-2024,2024-02-20 16:10:50,2024-02-20 16:10:50,02/20/2024 04:10:50 AM,20 Feb 2024 16:10:50,2024,2,20,16,10,50

In [316]:
# 요일 뽑기 dt.dayofweek
# 0 월 ~ 6 일
df['DateTime1'].dt.dayofweek

0    5
1    6
2    0
3    1
Name: DateTime1, dtype: int32

In [326]:
# 특정 단위로 데이터 바꾸기 dt.to_period(단위)
df['DateTime1'].dt.to_period('Y')
df['DateTime1'].dt.to_period('Q')
df['DateTime1'].dt.to_period('M')
df['DateTime1'].dt.to_period('D')
df['DateTime1'].dt.to_period('h')
df['DateTime1'].dt.to_period('h')

0    2024-02-17 13:00
1    2024-02-18 14:00
2    2024-02-19 15:00
3    2024-02-20 16:00
Name: DateTime1, dtype: period[h]

In [341]:
# Timedelta 이용하기
# datetime은 특정 시점의 날짜와 시간, Timedelta는 두 시점 사이의 차이
# months, weeks, days, hours, minutes, seconds

df = pd.read_csv('date_data.csv', usecols=['DateTime4'], parse_dates=['DateTime4'])
df

            DateTime4
0 2024-02-17 13:45:30
1 2024-02-18 14:55:45
2 2024-02-19 15:30:15
3 2024-02-20 16:10:50

In [342]:
df['100day'] = df['DateTime4'] + pd.Timedelta(days=99)
df

            DateTime4              100day
0 2024-02-17 13:45:30 2024-05-26 13:45:30
1 2024-02-18 14:55:45 2024-05-27 14:55:45
2 2024-02-19 15:30:15 2024-05-28 15:30:15
3 2024-02-20 16:10:50 2024-05-29 16:10:50

In [343]:
df['100hour'] = df['DateTime4'] + pd.Timedelta(hours=100)
df

            DateTime4              100day             100hour
0 2024-02-17 13:45:30 2024-05-26 13:45:30 2024-02-21 17:45:30
1 2024-02-18 14:55:45 2024-05-27 14:55:45 2024-02-22 18:55:45
2 2024-02-19 15:30:15 2024-05-28 15:30:15 2024-02-23 19:30:15
3 2024-02-20 16:10:50 2024-05-29 16:10:50 2024-02-24 20:10:50

In [344]:
df['difference'] = df['DateTime4'] - pd.Timedelta(weeks=7, days=7, hours=7, minutes=7, seconds=7)
df

,DateTime4,100day,100hour,difference
0,2024-02-17 13:45:30,2024-05-26 13:45:30,2024-02-21 17:45:30,2023-12-23 06:38:23
1,2024-02-18 14:55:45,2024-05-27 14:55:45,2024-02-22 18:55:45,2023-12-24 07:48:38
2,2024-02-19 15:30:15,2024-05-28 15:30:15,2024-02-23 19:30:15,2023-12-25 08:23:08
3,2024-02-20 16:10:50,2024-05-29 16:10:50,2024-02-24 20:10:50,2023-12-26 09:03:43

In [348]:
# 차이 구하기
diff = df['100hour'] - df['difference']
diff

0   60 days 11:07:07
1   60 days 11:07:07
2   60 days 11:07:07
3   60 days 11:07:07
dtype: timedelta64[ns]

In [356]:
# 차이를 초, 분, 시간, 일 단위로 바꾸기
diff.dt.total_seconds() # 초
diff.dt.total_seconds()/60 # 분
diff.dt.total_seconds()/60/60 # 시간
diff.dt.total_seconds()/60/60/24 # 일

0    60.463275
1    60.463275
2    60.463275
3    60.463275
dtype: float64

In [389]:
# Timedelta도 dt가 있음
# days, seconds, microseconds, total_seconds 를 지원함
print(diff.info())
display(diff)
display(diff.dt.seconds) # 11:07:07 초로 변환한 것
display(diff.dt.total_seconds()) # 전체를 초로 변환한 것

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      timedelta64[ns]
dtypes: timedelta64[ns](1)
memory usage: 160.0 bytes
None

0   60 days 11:07:07
1   60 days 11:07:07
2   60 days 11:07:07
3   60 days 11:07:07
dtype: timedelta64[ns]

0    40027
1    40027
2    40027
3    40027
dtype: int32

0    5224027.0
1    5224027.0
2    5224027.0
3    5224027.0
dtype: float64

In [391]:
# 시간 반올림
min = 5.41
print(int(min), '분')
print((min - int(min))*60, '초')

5 분
24.60000000000001 초

In [396]:
diff.dt.total_seconds()/60  # 분으로 환산한 것
round(diff.dt.total_seconds()/60) # 에 반올림

0    87067.0
1    87067.0
2    87067.0
3    87067.0
dtype: float64